@hadrouj you can assign multiple networks while still only creating one data source using Terraform features.  An example is shown below:

In my variables.tf I have a variable ```subnet_names``` defined as a list(array) of the names of the subnets I want to add
```tf
variable "subnet_names" {
  type = list
}
```
In my tfvars file I have that list populated with two values
```tf
subnet_names = [
    "Public 1",
    "Public 2"
]
```
Then in the module you can use ```count``` in the resource: 
```tf
data "vra_fabric_network" "subnets" {
  count  = length(var.subnet_names)
  filter = "name eq '${var.subnet_names[count.index]}'"
}
```

Then in the actual network profile resource you can do 
```tf
resource "vra_network_profile" "example" {
  name      = "count_example"
  region_id = data.vra_region.this.id
  // Assign multiple values 
  fabric_network_ids = data.vra_fabric_network.subnets[*].id

}
```

The output of ```terraform plan```  shows that both fabric_networks are being looked up and then assigned... 

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be      
persisted to local or remote state storage.

data.vra_cloud_account_vsphere.this: Refreshing state...
data.vra_fabric_network.subnets[0]: Refreshing state...
data.vra_fabric_network.subnets[1]: Refreshing state...
data.vra_region.this: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vra_network_profile.example will be created
  + resource "vra_network_profile" "example" {
      + custom_properties  = (known after apply)
      + external_region_id = (known after apply)
      + fabric_network_ids = [
          + "85cc701b-5c12-4185-9e57-5b22a5c8a8f7",
          + "1b3bf4b7-cae0-418d-aced-17d43858c1bc",
        ]
      + id                 = (known after apply)
      + links              = (known after apply)
      + name               = "count_example"
      + organization_id    = (known after apply)
      + owner              = (known after apply)
      + region_id          = "65c8e221-878b-42b7-a5c3-171c93bc67a2"
      + updated_at         = (known after apply)

      + tags {
          + key   = (known after apply)
          + value = (known after apply)
        }
        }
        }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
HTH

